[
  {
    "id": "color_enhancement",
    "group": "enhancements",
    "displayName": "Color enhancement",
    "shortDescription": "Colors appear more vivid, saturated, and emotionally salient than baseline.",
    "longDescription": "This effect increases perceived saturation and separation between hues, making scenes feel more vibrant and alive. It often co occurs with enhanced contrast and a sense that certain colors glow or carry meaning.",
    "typicalIntensityRange": [0.1, 0.8],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": [
      "lsd",
      "psilocybin",
      "mescaline",
      "dmt",
      "ayahuasca",
      "two_c_b",
      "two_c_e",
      "mdma",
      "mda"
    ],
    "notesOnSimulation": "Increase saturation with gentle hue protection, then add selective vibrance in mid tones. Couple small color pulses to audio or motion for a living feel."
  },
  {
    "id": "contrast_enhancement",
    "group": "enhancements",
    "displayName": "Contrast enhancement",
    "shortDescription": "Edges, shadows, and highlights separate more strongly, giving a crisp and high definition look.",
    "longDescription": "Local contrast increases can make textures pop and can amplify perceived depth. At higher intensity it can make scenes feel unreal or hyper real, as if clarity is turned beyond natural optics.",
    "typicalIntensityRange": [0.1, 0.7],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["lsd", "psilocybin", "mescaline", "two_c_e"],
    "notesOnSimulation": "Use local contrast or unsharp masking with restraint to avoid crunchy artifacts. Modulate contrast more in mid tones than extremes for a natural but heightened look."
  },
  {
    "id": "visual_acuity_enhancement",
    "group": "enhancements",
    "displayName": "Visual acuity enhancement",
    "shortDescription": "Fine detail seems unusually clear, as if focus and resolution have increased.",
    "longDescription": "Perceived sharpness increases, especially at edges and along repeating texture boundaries. Many people describe an ultra clear or ultra crisp feeling that can shift into over sharpened unreality at higher intensity.",
    "typicalIntensityRange": [0.05, 0.6],
    "primaryScales": ["meso", "micro"],
    "commonSubstances": ["lsd", "psilocybin", "mescaline"],
    "notesOnSimulation": "Add edge aware sharpening and micro contrast, then stabilize over time to avoid shimmer. Pair with mild chroma smoothing to keep the look clean."
  },
  {
    "id": "pattern_recognition_enhancement",
    "group": "enhancements",
    "displayName": "Pattern recognition enhancement",
    "shortDescription": "Hidden structure and meaningful forms seem to emerge from ambiguous textures.",
    "longDescription": "The visual system over interprets weak cues, so noise and texture begin to suggest faces, symbols, and repeating motifs. This effect can seed more elaborate geometry and pareidolia when intensity rises.",
    "typicalIntensityRange": [0.1, 0.7],
    "primaryScales": ["meso", "micro"],
    "commonSubstances": ["lsd", "psilocybin", "dmt", "ayahuasca"],
    "notesOnSimulation": "Use feature amplification on texture maps and add a low strength semantic overlay from segmentation or edge maps. Keep it subtle at low intensity so it reads as emergence rather than sticker art."
  },
  {
    "id": "glow_and_haloes",
    "group": "enhancements",
    "displayName": "Glow and haloes",
    "shortDescription": "Bright areas bloom and can form soft haloes or auras around objects.",
    "longDescription": "Luminance spreads beyond its physical boundary, giving lights a radiant presence and edges a gentle aura. This can contribute to a dreamy, warm, or sacred feeling depending on palette and context.",
    "typicalIntensityRange": [0.1, 0.8],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["mdma", "mda", "lsd", "psilocybin", "mescaline"],
    "notesOnSimulation": "Use bloom with a soft knee and a wide radius. Add a second subtle edge glow pass that follows high contrast boundaries to suggest an aura."
  },
  {
    "id": "texture_salience",
    "group": "enhancements",
    "displayName": "Texture salience",
    "shortDescription": "Surface textures become unusually attention grabbing and rich.",
    "longDescription": "Materials like wood grain, fabric weave, foliage, and stone appear deeper and more structured than usual. This often precedes drifting and geometry because the visual system locks onto repeating micro features.",
    "typicalIntensityRange": [0.1, 0.7],
    "primaryScales": ["micro"],
    "commonSubstances": ["lsd", "psilocybin", "mescaline", "two_c_b", "two_c_e"],
    "notesOnSimulation": "Boost micro contrast and gently amplify periodic components of textures. Use time coherent noise modulation so the texture feels alive without becoming unstable."
  },
  {
    "id": "breathing_surfaces",
    "group": "distortions",
    "displayName": "Breathing surfaces",
    "shortDescription": "Flat surfaces appear to expand and contract rhythmically.",
    "longDescription": "Walls, floors, and natural scenes can look like they inhale and exhale. The motion is usually slow, smooth, and spatially coherent, sometimes syncing with breath, music, or heartbeat.",
    "typicalIntensityRange": [0.2, 0.8],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["lsd", "psilocybin", "mescaline"],
    "notesOnSimulation": "Apply a low frequency displacement field with subtle depth dependent scaling. Drive the phase with a slow oscillator and keep edges anchored so the effect reads as breathing, not camera shake."
  },
  {
    "id": "visual_drifting",
    "group": "distortions",
    "displayName": "Visual drifting",
    "shortDescription": "Textures and boundaries gently slide, swirl, or creep in place.",
    "longDescription": "Drifting is a continuous transformation of perceived structure, often strongest on repeating textures. It can feel organic and fluid or geometric and tiled depending on substance and context.",
    "typicalIntensityRange": [0.2, 0.9],
    "primaryScales": ["meso", "micro"],
    "commonSubstances": ["lsd", "psilocybin", "mescaline", "two_c_b", "two_c_e"],
    "notesOnSimulation": "Use optical flow aligned warping or a material locked UV advection. Increase drift speed and curl noise over time as intensity rises, but preserve temporal coherence."
  },
  {
    "id": "flowing_textures",
    "group": "distortions",
    "displayName": "Flowing textures",
    "shortDescription": "Surface detail behaves like a fluid, streaming along invisible currents.",
    "longDescription": "Fine texture features can appear to move as if carried by a gentle current, sometimes looping in stable cycles. This often appears in foliage, clouds, carpet, or patterned fabric.",
    "typicalIntensityRange": [0.3, 0.9],
    "primaryScales": ["micro"],
    "commonSubstances": ["lsd", "psilocybin"],
    "notesOnSimulation": "Run a low velocity vector field over texture space and advect texture coordinates. Add a small divergence free curl component for an organic flow."
  },
  {
    "id": "melting_deformation",
    "group": "distortions",
    "displayName": "Melting deformation",
    "shortDescription": "Objects and edges sag, drip, or lose rigidity as if softened.",
    "longDescription": "Hard boundaries can appear to liquefy, with gravity like sagging or viscous motion. It often mixes with breathing and drifting, but has a distinct sense of structure losing stiffness.",
    "typicalIntensityRange": [0.3, 0.9],
    "primaryScales": ["meso"],
    "commonSubstances": ["lsd", "psilocybin"],
    "notesOnSimulation": "Use anisotropic displacement biased downward plus edge softening. Increase viscosity and slow the motion to avoid turning it into simple blur."
  },
  {
    "id": "morphing_objects",
    "group": "distortions",
    "displayName": "Morphing objects",
    "shortDescription": "Recognizable forms subtly change shape or identity while remaining partly anchored.",
    "longDescription": "Faces, hands, and objects can shift in proportion, expression, or texture, sometimes oscillating between interpretations. This is often reported as unsettling or fascinating depending on context.",
    "typicalIntensityRange": [0.2, 0.8],
    "primaryScales": ["meso"],
    "commonSubstances": ["lsd", "psilocybin", "two_c_e"],
    "notesOnSimulation": "Use segmentation guided deformation so object boundaries can warp without destroying the whole scene. Blend between multiple plausible shapes with slow noise driven interpolation."
  },
  {
    "id": "tracers_motion_trails",
    "group": "distortions",
    "displayName": "Tracers and motion trails",
    "shortDescription": "Moving objects leave persistent trails or multiple ghosted copies.",
    "longDescription": "Motion can appear to smear across time, as if the visual system retains prior frames. Trails are often strongest around bright objects and fast movement.",
    "typicalIntensityRange": [0.1, 0.8],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["lsd", "psilocybin", "two_c_b", "mdma", "mda"],
    "notesOnSimulation": "Accumulate prior frames using motion vectors and an exponential decay. Allow trail length to scale with intensity and with scene luminance."
  },
  {
    "id": "afterimage_persistence",
    "group": "distortions",
    "displayName": "Afterimage persistence",
    "shortDescription": "Recent visual impressions linger as faint silhouettes or color stains.",
    "longDescription": "Afterimages can appear as negative or positive remnants, and may persist longer than usual. In some cases the afterimage can drift slightly, creating a ghostly overlay.",
    "typicalIntensityRange": [0.1, 0.7],
    "primaryScales": ["meso"],
    "commonSubstances": ["lsd", "psilocybin", "dmt"],
    "notesOnSimulation": "Blend a faint delayed version of the frame with local edge emphasis. Use a separate decay rate for chroma and luminance to mimic colored persistence."
  },
  {
    "id": "perspective_warp",
    "group": "distortions",
    "displayName": "Perspective warp",
    "shortDescription": "Depth, angles, and camera like perspective appear subtly distorted.",
    "longDescription": "Rooms can feel stretched, corners can bend, and depth cues can become exaggerated. The distortion can be smooth and lens like or elastic and dreamlike depending on intensity.",
    "typicalIntensityRange": [0.2, 0.8],
    "primaryScales": ["macro"],
    "commonSubstances": ["lsd", "psilocybin", "salvia"],
    "notesOnSimulation": "Use a smoothly varying field of view modulation plus non linear barrel and pincushion warps. Add slow oscillation and keep the horizon stable unless simulating disorientation."
  },
  {
    "id": "field_of_view_stretching",
    "group": "distortions",
    "displayName": "Field of view stretching",
    "shortDescription": "The visual field stretches or compresses as if vision is pulled into a band or funnel.",
    "longDescription": "This effect can feel like tunnelling or like the scene is being stretched sideways or vertically. It is often reported in sudden onset hallucinogens and can be very disorienting.",
    "typicalIntensityRange": [0.4, 1.0],
    "primaryScales": ["macro"],
    "commonSubstances": ["dmt", "salvia"],
    "notesOnSimulation": "Apply a time varying non uniform scale around the center of gaze, combined with vignetting. Increase speed and amplitude sharply at high intensity for breakthrough style transitions."
  },
  {
    "id": "visual_snow",
    "group": "distortions",
    "displayName": "Visual snow",
    "shortDescription": "A fine static like grain overlays the scene, especially in low light.",
    "longDescription": "The field can contain shimmering speckle, crawling noise, or faint pointillism. It can be subtle and atmospheric or intense enough to interfere with clarity.",
    "typicalIntensityRange": [0.05, 0.6],
    "primaryScales": ["macro", "micro"],
    "commonSubstances": ["lsd", "psilocybin", "dmt"],
    "notesOnSimulation": "Add low amplitude luminance noise that is temporally correlated rather than pure random. Make it stronger in shadows and periphery to mimic reported salience."
  },
  {
    "id": "geometric_patterning",
    "group": "geometry",
    "displayName": "Geometric patterning",
    "shortDescription": "Structured repeating patterns appear as overlays or as the primary visual content.",
    "longDescription": "Geometry can range from simple grids and tessellations to intricate fractal ornamentation. It can appear with eyes closed, on surfaces with eyes open, or as an immersive replacement of the scene.",
    "typicalIntensityRange": [0.2, 1.0],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["lsd", "psilocybin", "mescaline", "dmt", "ayahuasca", "two_c_e"],
    "notesOnSimulation": "Generate patterns procedurally and lock them to surfaces with tracking. Increase complexity, symmetry, and depth cues as intensity rises."
  },
  {
    "id": "form_constant_tunnel",
    "group": "geometry",
    "displayName": "Form constant tunnel",
    "shortDescription": "A funnel or tunnel structure appears to extend into depth, often with motion through it.",
    "longDescription": "The tunnel may be made of repeating motifs, rings, or lattices and can feel like movement toward a center point. It is commonly reported across classic psychedelics and also in some non drug altered states.",
    "typicalIntensityRange": [0.4, 1.0],
    "primaryScales": ["macro"],
    "commonSubstances": ["mescaline", "dmt", "lsd"],
    "notesOnSimulation": "Use log polar mapping or radial coordinates to generate a stable funnel. Animate by zooming the phase and rotating layers, with depth shading to sell immersion."
  },
  {
    "id": "form_constant_spiral",
    "group": "geometry",
    "displayName": "Form constant spiral",
    "shortDescription": "Spiral vortices appear as rotating or unfolding structures in the visual field.",
    "longDescription": "Spirals can be single vortex forms or nested spirals that rotate and expand. They often blend into tunnel imagery when rotation and depth cues combine.",
    "typicalIntensityRange": [0.4, 1.0],
    "primaryScales": ["macro"],
    "commonSubstances": ["mescaline", "lsd", "dmt"],
    "notesOnSimulation": "Build spiral fields in polar coordinates and modulate thickness with noise. Keep rotation smooth and add nested harmonics for the classic multi spiral look."
  },
  {
    "id": "form_constant_lattice",
    "group": "geometry",
    "displayName": "Form constant lattice",
    "shortDescription": "Regular grids, honeycombs, or checkerboard like meshes overlay vision.",
    "longDescription": "Lattice imagery can appear as transparent structure on surfaces or as a full field pattern. Intersections may carry small highlights, eyes, or ornaments through pareidolia and feature amplification.",
    "typicalIntensityRange": [0.3, 1.0],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["mescaline", "lsd", "psilocybin"],
    "notesOnSimulation": "Use tiling primitives and enforce symmetry. Add subtle parallax and depth modulation so the lattice reads as spatial rather than flat wallpaper."
  },
  {
    "id": "form_constant_cobweb",
    "group": "geometry",
    "displayName": "Form constant cobweb",
    "shortDescription": "Web like filigree and radial mesh patterns appear, often delicate and detailed.",
    "longDescription": "Cobweb imagery can look like fine netting, lace, or radial spokes connected by thin arcs. It often appears as luminous line work over a darker background.",
    "typicalIntensityRange": [0.3, 1.0],
    "primaryScales": ["macro", "micro"],
    "commonSubstances": ["mescaline", "lsd"],
    "notesOnSimulation": "Generate thin line networks with radial symmetry and varying strand thickness. Use glow and slight motion to keep the filigree alive."
  },
  {
    "id": "fractal_recursion",
    "group": "geometry",
    "displayName": "Fractal recursion",
    "shortDescription": "Patterns repeat across scales, with self similarity and infinite zoom impressions.",
    "longDescription": "Fractal imagery often feels endless, as if zooming reveals the same motif again and again. It can be seen as ornamentation on objects or as fully immersive space filling structure.",
    "typicalIntensityRange": [0.4, 1.0],
    "primaryScales": ["macro", "micro"],
    "commonSubstances": ["dmt", "lsd", "mescaline", "psilocybin"],
    "notesOnSimulation": "Use iterative fractal functions or feedback zoom shaders. Animate zoom and rotation smoothly and keep color cycling controlled to avoid visual noise."
  },
  {
    "id": "mandala_forms",
    "group": "geometry",
    "displayName": "Mandala forms",
    "shortDescription": "Radially symmetric, centered patterns appear like ornate circular designs.",
    "longDescription": "Mandala forms often emerge behind closed eyes or in low light, and can feel emotionally charged or sacred. They commonly combine symmetry, repetition, and layered depth.",
    "typicalIntensityRange": [0.3, 1.0],
    "primaryScales": ["macro"],
    "commonSubstances": ["psilocybin", "mescaline", "dmt", "ayahuasca"],
    "notesOnSimulation": "Generate radial symmetry with multiple rings and petal like motifs. Add slow breathing in scale and subtle depth shading to suggest layered structure."
  },
  {
    "id": "kaleidoscopic_tiling",
    "group": "geometry",
    "displayName": "Kaleidoscopic tiling",
    "shortDescription": "The scene repeats through mirrored symmetry, like looking through a kaleidoscope.",
    "longDescription": "Tiling can affect only textures, or it can replicate whole objects and regions of the scene. The result is strong symmetry and repeated motifs that can rotate or slide.",
    "typicalIntensityRange": [0.3, 1.0],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["mescaline", "lsd", "dmt", "two_c_e"],
    "notesOnSimulation": "Apply mirror based symmetry transforms around a chosen center. Blend between multiple symmetry orders over time for dynamic kaleidoscope transitions."
  },
  {
    "id": "closed_eye_visuals",
    "group": "hallucinations",
    "displayName": "Closed eye visuals",
    "shortDescription": "With eyes closed, imagery appears ranging from abstract patterns to complex scenes.",
    "longDescription": "Closed eye visuals often begin as color fields and geometry, then can develop into representational scenes at higher intensity. They are typically more vivid in darkness and can feel more immersive than open eye distortions.",
    "typicalIntensityRange": [0.2, 1.0],
    "primaryScales": ["macro"],
    "commonSubstances": ["lsd", "psilocybin", "mescaline", "dmt", "ayahuasca", "mda"],
    "notesOnSimulation": "Treat this as a full frame generative layer rather than a surface overlay. Use coherent motion and evolving motifs, and ramp complexity with intensity."
  },
  {
    "id": "internal_scene_hallucinations",
    "group": "hallucinations",
    "displayName": "Internal scene hallucinations",
    "shortDescription": "Imagery becomes scene like, with places, characters, and narrative flow.",
    "longDescription": "This includes dreamlike sequences, memories, symbolic stories, and novel environments. Scenes can be richly detailed and may feel meaningful or guided.",
    "typicalIntensityRange": [0.5, 1.0],
    "primaryScales": ["macro"],
    "commonSubstances": ["ayahuasca", "dmt", "psilocybin", "mescaline"],
    "notesOnSimulation": "Use a scene graph approach with motif persistence across cuts. Blend geometric scaffolding into representational imagery via gradual morphs rather than abrupt swaps."
  },
  {
    "id": "entity_encounters",
    "group": "hallucinations",
    "displayName": "Entity encounters",
    "shortDescription": "Autonomous beings are perceived as present and can appear to interact.",
    "longDescription": "Entities may be humanoid, animal like, or abstract, and are often described as having agency. This can co occur with immersive environments and intense geometric structure.",
    "typicalIntensityRange": [0.6, 1.0],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["dmt", "ayahuasca"],
    "notesOnSimulation": "Let agents emerge from structure using face and body priors plus symmetry. Keep them partially ambiguous at moderate intensity and more coherent only at strong intensity."
  },
  {
    "id": "scene_replacement",
    "group": "hallucinations",
    "displayName": "Scene replacement",
    "shortDescription": "Normal perception is replaced by a different environment or reality.",
    "longDescription": "Instead of seeing the current room or landscape, perception shifts into an alternate scene that can feel fully real. This is more common in sudden onset substances and at very high intensity.",
    "typicalIntensityRange": [0.7, 1.0],
    "primaryScales": ["macro"],
    "commonSubstances": ["dmt", "salvia"],
    "notesOnSimulation": "Implement a transition that rapidly increases geometry, then cross fades into a generated world. Preserve motion continuity so the swap feels like passage rather than a hard cut."
  },
  {
    "id": "external_object_hallucinations",
    "group": "hallucinations",
    "displayName": "External object hallucinations",
    "shortDescription": "Distinct objects or beings appear in the environment as if truly present.",
    "longDescription": "Unlike overlays and distortions, this adds novel objects with apparent solidity and stable placement in the scene. It is uncommon for many psychedelics at typical intensity but becomes more plausible at very high intensity or in deliriant states.",
    "typicalIntensityRange": [0.8, 1.0],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["deliriant", "salvia"],
    "notesOnSimulation": "Insert objects with correct occlusion, lighting, and shadow so they read as real. Keep behavior mundane and scene consistent to mimic realism."
  },
  {
    "id": "pareidolia",
    "group": "perceptual",
    "displayName": "Pareidolia",
    "shortDescription": "Meaningful forms such as faces or symbols are seen in ambiguous patterns.",
    "longDescription": "This effect turns noise and texture into interpretable shapes. It often acts as a bridge between simple patterning and more elaborate hallucinated content.",
    "typicalIntensityRange": [0.2, 0.9],
    "primaryScales": ["meso", "micro"],
    "commonSubstances": ["lsd", "psilocybin", "ayahuasca", "dmt"],
    "notesOnSimulation": "Use weak semantic priors: lightly blend in face like templates, symbol atlases, or segmentation driven texture substitutions. Keep confidence low so forms flicker in and out."
  },
  {
    "id": "audio_visual_synesthesia",
    "group": "perceptual",
    "displayName": "Audio visual synesthesia",
    "shortDescription": "Sounds influence visual motion, color, or structure as if the senses are coupled.",
    "longDescription": "Music can appear to drive the timing and shape of patterns, and visual intensity can rise with rhythmic or harmonic events. The coupling can be subtle or strongly deterministic.",
    "typicalIntensityRange": [0.2, 0.9],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["lsd", "psilocybin", "mdma", "mda"],
    "notesOnSimulation": "Map audio features to visual parameters: beat to motion amplitude, spectral centroid to hue, and loudness to bloom and contrast. Smooth the control signals to keep motion coherent."
  },
  {
    "id": "depth_and_scale_shift",
    "group": "perceptual",
    "displayName": "Depth and scale shift",
    "shortDescription": "Distances and sizes feel unstable, with objects seeming closer, farther, larger, or smaller.",
    "longDescription": "Depth cues can become exaggerated or inconsistent, producing dollhouse or vastness impressions. This can also manifest as sudden zoom like changes without camera motion.",
    "typicalIntensityRange": [0.2, 0.9],
    "primaryScales": ["macro"],
    "commonSubstances": ["lsd", "psilocybin", "dmt", "salvia"],
    "notesOnSimulation": "Use depth maps to modulate scale and blur in a time varying way. Combine subtle focal length drift with selective object scaling for the most convincing effect."
  },
  {
    "id": "time_slicing",
    "group": "perceptual",
    "displayName": "Time slicing",
    "shortDescription": "Motion is perceived in discrete slices, as if time is segmented into frames.",
    "longDescription": "Movement can look like a flipbook, with separated snapshots rather than smooth continuity. This can co occur with tracers, but the key signature is discrete temporal segmentation.",
    "typicalIntensityRange": [0.3, 0.9],
    "primaryScales": ["macro", "meso"],
    "commonSubstances": ["lsd", "psilocybin", "dmt", "salvia"],
    "notesOnSimulation": "Use multi exposure compositing with gated frame holds, then soften with a small blur. Modulate the gating with audio rhythm for a synesthetic feel."
  },
  {
    "id": "dissociative_spatial_discontinuity",
    "group": "perceptual",
    "displayName": "Dissociative spatial discontinuity",
    "shortDescription": "Space breaks into slices, panels, loops, or impossible rearrangements.",
    "longDescription": "Instead of smooth warping, the scene can fracture into repeated segments, rotate like pages, or move as if on mechanical tracks. This effect is especially characteristic of salvia like states.",
    "typicalIntensityRange": [0.5, 1.0],
    "primaryScales": ["macro"],
    "commonSubstances": ["salvia"],
    "notesOnSimulation": "Use tiling and slicing transforms with hard boundaries, then animate the panels with a single dominant direction. Keep color changes secondary so the effect reads as spatial, not decorative."
  }
]
